In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
obj = Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [6]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2['a']

-5

In [9]:
obj2['d'] = 6

In [10]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2[['c', 'a', 'b']]

c    3
a   -5
b    7
dtype: int64

In [12]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [13]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [15]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
'b' in obj2

True

In [17]:
'e' in obj2

False

In [18]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [19]:
obj2 = Series(sdata)

In [20]:
obj2

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [21]:
states = ['California', 'Ohio', 'Texas', 'Oregon']

In [22]:
obj3 = Series(sdata, index=states)
obj3

California      NaN
Ohio          35000
Texas         71000
Oregon        16000
dtype: float64

In [23]:
pd.isnull(obj3)

California     True
Ohio          False
Texas         False
Oregon        False
dtype: bool

In [24]:
pd.notnull(obj3)

California    False
Ohio           True
Texas          True
Oregon         True
dtype: bool

In [25]:
obj2 + obj3

California       NaN
Ohio           70000
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

In [26]:
obj3.name = 'population'
obj3.index.name = 'state'
obj3

state
California      NaN
Ohio          35000
Texas         71000
Oregon        16000
Name: population, dtype: float64

In [27]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [28]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [29]:
obj.name = 'People'
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
Name: People, dtype: int64

In [30]:
obj.index.name = 'name'

In [31]:
obj

name
Bob      4
Steve    7
Jeff    -5
Ryan     3
Name: People, dtype: int64

In [1]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.2, 1.5, 3.6, 2.4, 2.9]}

In [2]:
data

{'pop': [1.2, 1.5, 3.6, 2.4, 2.9],
 'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002]}

In [4]:
frame = DataFrame(data)

In [6]:
frame

   pop   state  year
0  1.2    Ohio  2000
1  1.5    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [7]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.2
1  2001    Ohio  1.5
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [8]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])

In [9]:
frame2

       year   state  pop debt
one    2000    Ohio  1.2  NaN
two    2001    Ohio  1.5  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [10]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [11]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [12]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [13]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [14]:
frame2['debt'] = 16.5

In [15]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.2  16.5
two    2001    Ohio  1.5  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [16]:
frame2['debt'] = np.arange(5)

In [17]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.2     0
two    2001    Ohio  1.5     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [18]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [19]:
frame2['debt'] = val

In [20]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.2   NaN
two    2001    Ohio  1.5  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [21]:
frame2['eastern'] = frame2.state == 'Ohio'

In [22]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.2   NaN    True
two    2001    Ohio  1.5  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [23]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'eastern'], dtype='object')

In [25]:
del frame2['eastern']

In [26]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [8]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2001: 1.5, 2002: 1.7}}

In [9]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2001: 1.5, 2002: 1.7}}

In [10]:
frame3 = DataFrame(pop)

In [11]:
frame3

      Nevada  Ohio
2001     2.4   1.5
2002     2.9   1.7

In [31]:
frame3.T

        2001  2002
Nevada   2.4   2.9
Ohio     1.5   1.7

In [32]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.5
2002     2.9   1.7
2003     NaN   NaN

In [33]:
pdata = {'Nevada': frame3['Nevada'][:-1], 'Ohio': frame3['Ohio'][:2]}

In [34]:
DataFrame(pdata)

      Nevada  Ohio
2001     2.4   1.5
2002     NaN   1.7

In [35]:
frame3.index.name = 'year'

In [36]:
frame3.columns.name= 'state'

In [37]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.5
2002      2.9   1.7

In [38]:
frame3.values

array([[ 2.4,  1.5],
       [ 2.9,  1.7]])

In [39]:
frame2.values

array([[2000, 'Ohio', 1.2, nan],
       [2001, 'Ohio', 1.5, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

In [2]:
obj = Series(range(3), index=['a', 'b', 'c'])

In [3]:
index = obj.index

In [4]:
index

Index(['a', 'b', 'c'], dtype='object')

In [5]:
index[1:]

Index(['b', 'c'], dtype='object')

In [6]:
index[1] = 'd'

TypeError: Indexes does not support mutable operations

In [12]:
frame3

      Nevada  Ohio
2001     2.4   1.5
2002     2.9   1.7

In [14]:
'Ohio' in frame3.columns

True

In [15]:
2003 in frame3.index

False

In [16]:
obj = Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])

In [17]:
obj

a    1
b    2
c    3
d    4
dtype: int64

In [18]:
obj2 = obj.reindex(['e', 'd', 'c', 'b', 'a'])

In [19]:
obj2

e   NaN
d     4
c     3
b     2
a     1
dtype: float64

In [20]:
obj2 = obj.reindex(['e', 'd', 'c', 'b', 'a'], fill_value=0)

In [21]:
obj2

e    0
d    4
c    3
b    2
a    1
dtype: int64

In [22]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [23]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [24]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [25]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

In [26]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [27]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [28]:
frame2

   Ohio  Texas  California
a     0      1           2
b   NaN    NaN         NaN
c     3      4           5
d     6      7           8

In [29]:
states = ['Texas', 'Utah', 'California']

In [30]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [33]:
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a      1   NaN           2
b    NaN   NaN         NaN
c      4   NaN           5
d      7   NaN           8

In [34]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [35]:
obj = Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])

In [36]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [37]:
new_obj = obj.drop('c')

In [38]:
new_obj

a    0
b    1
d    3
e    4
dtype: int64

In [39]:
obj.drop(['d', 'c'])

a    0
b    1
e    4
dtype: int64

In [40]:
obj['b':'d']

b    1
c    2
d    3
dtype: int64

In [41]:
obj[obj < 2]

a    0
b    1
dtype: int64

In [42]:
frame < 5

    Ohio  Texas California
a   True   True       True
c   True   True      False
d  False  False      False

In [43]:
s1 = Series([1, 2, 3, 4], index=['a', 'c', 'd', 'e'])
s2 = Series([2, 4, 6, 8, 10], index=['a', 'c', 'e', 'f', 'g'])

In [45]:
s1 + s2

a     3
c     6
d   NaN
e    10
f   NaN
g   NaN
dtype: float64

In [47]:
list('foobar')

['f', 'o', 'o', 'b', 'a', 'r']

In [48]:
frame = DataFrame(np.random.randn(4,3), columns=list('bcd'), index=['Utah', 'Ohio', 'Texas', 'California'])

In [49]:
frame

                   b         c         d
Utah       -0.590608  0.499822  0.925877
Ohio       -0.870204  0.522161 -0.463972
Texas       1.113867 -0.954501 -0.802125
California -0.386770  0.216193 -0.676234

In [50]:
np.abs(frame)

                   b         c         d
Utah        0.590608  0.499822  0.925877
Ohio        0.870204  0.522161  0.463972
Texas       1.113867  0.954501  0.802125
California  0.386770  0.216193  0.676234

In [51]:
f = lambda x: x.max() - x.min()

In [52]:
frame.apply(f)

b    1.984071
c    1.476662
d    1.728002
dtype: float64

In [53]:
frame.apply(f, axis=1)

Utah          1.516485
Ohio          1.392365
Texas         2.068368
California    0.892427
dtype: float64

In [54]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [55]:
frame.apply(f)

            b         c         d
min -0.870204 -0.954501 -0.802125
max  1.113867  0.522161  0.925877

In [56]:
frame = DataFrame({'b': [1, 2, 3, 4], 'a': [5, 6, 7, 8]})

In [57]:
frame

   a  b
0  5  1
1  6  2
2  7  3
3  8  4

In [59]:
frame.sort_index(by='b')

   a  b
0  5  1
1  6  2
2  7  3
3  8  4

In [60]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [61]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [62]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=['a', 'b', 'c', 'd'], columns=['one', 'two'])

In [63]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [64]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [65]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [66]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [67]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [68]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [69]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [86]:
import pandas.io.data as web
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'ORCL']:
    all_data[ticker] = web.DataReader(ticker, 'yahoo', '1/1/2000', '1/1/2010')
    
price = DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

In [87]:
price

                AAPL        IBM      MSFT      ORCL
Date
2000-01-03   3.75524   93.45648  41.20297  27.75086
2000-01-04   3.43863   90.28419  39.81113  25.29880
2000-01-05   3.48895   93.45648  40.23089  23.96264
2000-01-06   3.18703   91.84516  38.88323  22.55308
2000-01-07   3.33799   91.44233  39.39137  24.28567
2000-01-10   3.27928   95.06779  39.67857  27.19290
2000-01-11   3.11154   95.87346  38.66231  26.40002
2000-01-12   2.92493   96.27628  37.40302  24.81426
2000-01-13   3.24573   95.26921  38.10999  24.68210
2000-01-14   3.36943   96.37699  39.67857  25.09323
2000-01-18   3.48685   93.25507  40.76112  26.13573
2000-01-19   3.57491   96.27628  37.82278  26.84051
2000-01-20   3.80765   95.87346  37.46930  27.83895
2000-01-21   3.73427   97.88760  36.67396  28.04452
2000-01-24   3.56443   97.88760  35.79025  25.46031
2000-01-25   3.76572   95.97417  36.34257  26.51748
2000-01-26   3.69653   94.06072  35.12747  25.87143
2000-01-27   3.69024   91.44233  34.90654  24.34440
2000-01-28   3.40927   89.88136  34.72980  22.25942
2000-01-31   3.48057   90.43526  34.59724  23.47076
2000-02-01   3.36315   88.62252  36.38675  25.37221
2000-02-02   3.31492   91.44233  35.63560  25.51904
2000-02-03   3.46588   94.36285  36.62977  26.63495
2000-02-04   3.62314   93.15436  37.66813  27.16354
2000-02-07   3.82652   91.94587  37.69023  28.16198
2000-02-08   3.85378   95.82315  38.86114  27.98578
2000-02-09   3.77830   94.66380  36.76233  28.16198
2000-02-10   3.80765   96.07519  37.46930  29.27789
2000-02-11   3.64830   93.05079  35.32630  28.04452
2000-02-14   3.88523   93.60526  35.21584  29.21915
...              ...        ...       ...       ...
2009-11-18  27.63786  114.78324  26.04280  21.58554
2009-11-19  26.90652  114.23688  25.75738  21.19737
2009-11-20  26.82735  113.71737  25.61899  21.15004
2009-11-23  27.62712  114.82803  25.89577  21.39619
2009-11-24  27.43388  114.58620  25.86982  20.96069
2009-11-25  27.40034  114.00400  25.76603  21.39619
2009-11-27  26.91725  112.58880  25.27302  20.91335
2009-11-30  26.82601  113.17100  25.43736  20.90389
2009-12-01  26.43149  114.59515  25.95631  21.24471
2009-12-02  26.33219  113.94130  25.75738  21.45299
2009-12-03  26.36573  114.24583  25.80062  21.43406
2009-12-04  25.94169  113.97713  25.93036  21.61394
2009-12-07  25.35528  113.78903  25.76603  21.28258
2009-12-08  25.47874  113.57407  25.57574  20.74294
2009-12-09  26.54286  114.99821  25.69683  20.78081
2009-12-10  26.35902  115.84912  25.83522  21.38672
2009-12-11  26.12285  116.15366  25.81792  21.56660
2009-12-14  26.43283  116.37758  26.04280  22.06837
2009-12-15  26.05575  115.08779  25.96496  21.92636
2009-12-16  26.17116  115.28484  26.03415  21.88849
2009-12-17  25.74577  114.11148  25.60169  21.66127
2009-12-18  26.22483  114.56828  26.25903  23.04351
2009-12-21  26.60056  115.23109  26.39742  23.12871
2009-12-22  26.88639  116.37758  26.65689  23.15711
2009-12-23  27.11988  116.44028  26.74339  23.41273
2009-12-24  28.05117  116.95084  26.81258  23.62102
2009-12-28  28.39603  118.50934  26.95962  23.63995
2009-12-29  28.05922  118.09733  27.14990  23.67782
2009-12-30  28.40006  118.74223  26.77798  23.60208
2009-12-31  28.27795  117.24641  26.36282  23.22339

[2515 rows x 4 columns]

In [88]:
volume

                 AAPL       IBM       MSFT       ORCL
Date
2000-01-03  133949200  10347700   53228400   98114800
2000-01-04  128094400   8227800   54119000  116824800
2000-01-05  194580400  12733200   64059600  166054000
2000-01-06  191993200   7971900   54976600  109880000
2000-01-07  115183600  11856700   62013600   91755600
2000-01-10  126266000   8540500   44963600   91518000
2000-01-11  110387200   7873300   46743600   86585200
2000-01-12  244017200   6803800   66532400   83443600
2000-01-13  258171200   8489700   83144000   55779200
2000-01-14   97594000  10956600   73416400   57078000
2000-01-18  114794400   7643900   81483600   66780000
2000-01-19  149410800   8634500   97568200   49198400
2000-01-20  457783200  17783400   56349800   54526800
2000-01-21  123981200   7868700   68416200   50891000
2000-01-24  110219200   6499200   63597600   50022400
2000-01-25  124286400   6936900   59823200   53059200
2000-01-26   91789600   4895100   49365000   47569200
2000-01-27   85036000   8324600   63654800   61054000
2000-01-28  105837200   6669400   58225400   86394000
2000-01-31  175420000   6202700   73194200   68148000
2000-02-01   79508800   7304700   70196600   57105600
2000-02-02  116048800   7707700   49915600   63933000
2000-02-03  118798400   6213800   49186000   55533200
2000-02-04  106330000   5405300   55365400   40916000
2000-02-07  110266800   5779500   40005800   44691200
2000-02-08  102160800   5464300   56229000   55718000
2000-02-09   74841200   5374700   55090000   52471600
2000-02-10   75745600   4446600   54527800   45288600
2000-02-11   53062800   5749400  115559000   55774000
2000-02-14   91884800   4544000   81028600   37599800
...               ...       ...        ...        ...
2009-11-18   93580200   3970100   59431200   14827600
2009-11-19  135581600   5308400   51967700   17651800
2009-11-20  101666600   5354200   42647100   24493900
2009-11-23  118724200   7003500   41832700   22713600
2009-11-24   79609600   4816500   37341400   24232600
2009-11-25   71613500   3967700   32033500   24123500
2009-11-27   73814300   3319200   29357900   12569100
2009-11-30  106214500   6302700   44172000   26291700
2009-12-01  116440800   6578600   49904200   28447900
2009-12-02  178815000   4597900   36308600   21160800
2009-12-03  112179900   5760000   43095200   22492500
2009-12-04  206721200   7068500   58810700   27814200
2009-12-07  178689700   4144400   38082700   24138100
2009-12-08  172599700   5351400   37402200   27902700
2009-12-09  171195500   6071900   44713300   28550400
2009-12-10  122417400   7077800   45940200   34877300
2009-12-11  107443700   6597200   43744200   26741900
2009-12-14  123947600   5201300   34651200   32293900
2009-12-15  104864900   7862600   49473200   24653700
2009-12-16   88246200   6372500   55737800   30037100
2009-12-17   97209700   5909500   43691200   35972600
2009-12-18  152192600   9106600   94118000   88246400
2009-12-21  152976600   4772500   40129100   26935500
2009-12-22   87378900   5535500   36321000   23847200
2009-12-23   86381400   4127600   28362700   19257800
2009-12-24  125222300   4265100   11083900    7782700
2009-12-28  161141400   5800400   25384000   15927500
2009-12-29  111301400   4184200   29716200   16214100
2009-12-30  103021100   3867000   42006200   18697400
2009-12-31   88102700   4223400   31929700   17714100

[2515 rows x 4 columns]

In [89]:
returns = price.pct_change()

In [90]:
returns.tail()

                AAPL       IBM      MSFT      ORCL
Date
2009-12-24  0.034340  0.004385  0.002587  0.008896
2009-12-28  0.012294  0.013326  0.005484  0.000801
2009-12-29 -0.011861 -0.003477  0.007058  0.001602
2009-12-30  0.012147  0.005461 -0.013699 -0.003199
2009-12-31 -0.004300 -0.012597 -0.015504 -0.016045

In [91]:
returns.MSFT.corr(returns.IBM)

0.49597947576514495

In [92]:
returns.MSFT.cov(returns.IBM)

0.00021595767179041924

In [93]:
returns.corr()

          AAPL       IBM      MSFT      ORCL
AAPL  1.000000  0.410012  0.424304  0.413356
IBM   0.410012  1.000000  0.495979  0.508264
MSFT  0.424304  0.495979  1.000000  0.513280
ORCL  0.413356  0.508264  0.513280  1.000000

In [94]:
returns.cov()

          AAPL       IBM      MSFT      ORCL
AAPL  0.001027  0.000252  0.000309  0.000414
IBM   0.000252  0.000367  0.000216  0.000304
MSFT  0.000309  0.000216  0.000516  0.000364
ORCL  0.000414  0.000304  0.000364  0.000975

In [95]:
returns.corrwith(returns.IBM)

AAPL    0.410012
IBM     1.000000
MSFT    0.495979
ORCL    0.508264
dtype: float64

In [96]:
returns.corrwith(volume)

AAPL   -0.057548
IBM    -0.007892
MSFT   -0.014245
ORCL   -0.011329
dtype: float64

In [97]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [98]:
uniques = obj.unique()

In [99]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [100]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [101]:
pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [102]:
mask = obj.isin(['b', 'c'])

In [103]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [104]:
data = DataFrame({'a': [1, 3, 4, 3, 4], 'b': [2, 3, 1, 2, 3], 'c': [1, 5, 2, 4, 4]})

In [106]:
data

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [109]:
data.apply(pd.value_counts)

    a   b   c
1   1   1   1
2 NaN   2   1
3   2   2 NaN
4   2 NaN   2
5 NaN NaN   1

In [112]:
obj = Series([4, np.nan, 6, np.nan, -3, 2])

In [113]:
obj.order()

4    -3
5     2
0     4
2     6
1   NaN
3   NaN
dtype: float64

In [114]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [115]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [117]:
obj.index.is_unique

False

In [118]:
string_data = Series(['aa', 'ab', np.nan, 'ad'])

In [119]:
string_data

0     aa
1     ab
2    NaN
3     ad
dtype: object

In [120]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [121]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [122]:
data = Series([1, 2, np.nan, 4, 5, np.nan])

In [123]:
data.dropna()

0    1
1    2
3    4
4    5
dtype: float64

In [124]:
data[data.notnull()]

0    1
1    2
3    4
4    5
dtype: float64

In [126]:
data = DataFrame([[1, 2, 3], [4, np.nan, np.nan], [np.nan, 8, 9]])

In [127]:
data.dropna()

   0  1  2
0  1  2  3

In [128]:
data.dropna(how='all')

    0   1   2
0   1   2   3
1   4 NaN NaN
2 NaN   8   9

In [129]:
data.fillna(0)

   0  1  2
0  1  2  3
1  4  0  0
2  0  8  9

In [130]:
data.stack()

0  0    1
   1    2
   2    3
1  0    4
2  1    8
   2    9
dtype: float64